"{\"class_name\": \"Tokenizer\", \"config\": {\"num_words\": null, \"filters\": \"!\\\"#$%&()*+,-./:;<=>?@[\\\\]^_`{|}~\\t\\n\", \"lower\": true, \"split\": \" \", \"char_level\": true, \"oov_token\": null, \"document_count\": 18635, \"word_counts\": \"{\\\"p\\\": 6077, \\\"a\\\": 16928, \\\"r\\\": 15884, \\\"k\\\": 2739, \\\"e\\\": 23967, \\\"t\\\": 10142, \\\"s\\\": 9729, \\\"d\\\": 6367, \\\"l\\\": 12730, \\\" \\\": 15341, \\\"b\\\": 5361, \\\"o\\\": 11934, \\\"w\\\": 3317, \\\"n\\\": 12700, \\\"c\\\": 7176, \\\"u\\\": 6718, \\\"m\\\": 5321, \\\"h\\\": 5247, \\\"i\\\": 12663, \\\"g\\\": 6135, \\\"f\\\": 2481, \\\"x\\\": 251, \\\"y\\\": 4002, \\\"v\\\": 2092, \\\"q\\\": 434, \\\"z\\\": 665, \\\"j\\\": 411, \\\"(\\\": 137, \\\")\\\": 137, \\\"/\\\": 6, \\\"-\\\": 57, \\\"'\\\": 23, \\\"\\\\u2019\\\": 3, \\\"\\\\u00e9\\\": 5, \\\"&\\\": 2, \\\"[\\\": 2, \\\"]\\\": 2, \\\"1\\\": 18, \\\"\\\\u00e0\\\": 2, \\\"\\\\u00fa\\\": 2, \\\"2\\\": 2, \\\"9\\\": 4, \\\"#\\\": 2, \\\"3\\\": 2, \\\"7\\\": 1, \\\".\\\": 2, \\\"\\\\u00e3\\\": 36, \\\"\\\\u0192\\\": 23, \\\"\\\\u00e2\\\": 34, \\\"\\\\u00ad\\\": 15, \\\"\\\\u201a\\\": 13, \\\"\\\\u00b1\\\": 2, \\\"\\\\u00a9\\\": 8, \\\"\\\\u20ac\\\": 4, \\\"\\\\u0161\\\": 4, \\\"\\\\u00eb\\\": 1, \\\"\\\\u2020\\\": 1, \\\"_\\\": 1, \\\"\\\\u00a4\\\": 1, \\\"\\\\u00a2\\\": 2, \\\"\\\\u00ac\\\": 1, \\\"\\\\u00b9\\\": 1, \\\"\\\\u00e5\\\": 2, \\\"\\\\u00bc\\\": 1}\", \"word_docs\": \"{\\\"e\\\": 14263, \\\"p\\\": 4778, \\\"t\\\": 8115, \\\"r\\\": 11957, \\\"a\\\": 12059, \\\"k\\\": 2576, \\\" \\\": 14084, \\\"w\\\": 3086, \\\"s\\\": 7816, \\\"l\\\": 9408, \\\"b\\\": 4715, \\\"o\\\": 9085, \\\"n\\\": 9942, \\\"d\\\": 5562, \\\"c\\\": 6047, \\\"h\\\": 4727, \\\"u\\\": 5839, \\\"m\\\": 4716, \\\"i\\\": 9736, \\\"g\\\": 5353, \\\"f\\\": 2162, \\\"x\\\": 250, \\\"y\\\": 3784, \\\"v\\\": 1940, \\\"q\\\": 427, \\\"z\\\": 558, \\\"j\\\": 402, \\\"(\\\": 132, \\\")\\\": 132, \\\"/\\\": 6, \\\"-\\\": 56, \\\"'\\\": 23, \\\"\\\\u2019\\\": 3, \\\"\\\\u00e9\\\": 5, \\\"&\\\": 2, \\\"]\\\": 2, \\\"[\\\": 2, \\\"1\\\": 10, \\\"\\\\u00fa\\\": 2, \\\"\\\\u00e0\\\": 2, \\\"2\\\": 2, \\\"9\\\": 4, \\\"#\\\": 2, \\\"3\\\": 2, \\\"7\\\": 1, \\\".\\\": 2, \\\"\\\\u00e3\\\": 16, \\\"\\\\u00b1\\\": 2, \\\"\\\\u0192\\\": 16, \\\"\\\\u00ad\\\": 13, \\\"\\\\u201a\\\": 12, \\\"\\\\u00e2\\\": 16, \\\"\\\\u00a9\\\": 8, \\\"\\\\u20ac\\\": 4, \\\"\\\\u0161\\\": 4, \\\"\\\\u00eb\\\": 1, \\\"\\\\u2020\\\": 1, \\\"_\\\": 1, \\\"\\\\u00a2\\\": 1, \\\"\\\\u00b9\\\": 1, \\\"\\\\u00a4\\\": 1, \\\"\\\\u00ac\\\": 1, \\\"\\\\u00e5\\\": 2, \\\"\\\\u00bc\\\": 1}\", \"index_docs\": \"{\\\"1\\\": 14263, \\\"15\\\": 4778, \\\"9\\\": 8115, \\\"3\\\": 11957, \\\"2\\\": 12059, \\\"21\\\": 2576, \\\"4\\\": 14084, \\\"20\\\": 3086, \\\"10\\\": 7816, \\\"5\\\": 9408, \\\"16\\\": 4715, \\\"8\\\": 9085, \\\"6\\\": 9942, \\\"13\\\": 5562, \\\"11\\\": 6047, \\\"18\\\": 4727, \\\"12\\\": 5839, \\\"17\\\": 4716, \\\"7\\\": 9736, \\\"14\\\": 5353, \\\"22\\\": 2162, \\\"27\\\": 250, \\\"19\\\": 3784, \\\"23\\\": 1940, \\\"25\\\": 427, \\\"24\\\": 558, \\\"26\\\": 402, \\\"28\\\": 132, \\\"29\\\": 132, \\\"39\\\": 6, \\\"30\\\": 56, \\\"33\\\": 23, \\\"44\\\": 3, \\\"40\\\": 5, \\\"45\\\": 2, \\\"47\\\": 2, \\\"46\\\": 2, \\\"35\\\": 10, \\\"49\\\": 2, \\\"48\\\": 2, \\\"50\\\": 2, \\\"41\\\": 4, \\\"51\\\": 2, \\\"52\\\": 2, \\\"57\\\": 1, \\\"53\\\": 2, \\\"31\\\": 16, \\\"54\\\": 2, \\\"34\\\": 16, \\\"36\\\": 13, \\\"37\\\": 12, \\\"32\\\": 16, \\\"38\\\": 8, \\\"42\\\": 4, \\\"43\\\": 4, \\\"58\\\": 1, \\\"59\\\": 1, \\\"60\\\": 1, \\\"55\\\": 1, \\\"63\\\": 1, \\\"61\\\": 1, \\\"62\\\": 1, \\\"56\\\": 2, \\\"64\\\": 1}\", \"index_word\": \"{\\\"1\\\": \\\"e\\\", \\\"2\\\": \\\"a\\\", \\\"3\\\": \\\"r\\\", \\\"4\\\": \\\" \\\", \\\"5\\\": \\\"l\\\", \\\"6\\\": \\\"n\\\", \\\"7\\\": \\\"i\\\", \\\"8\\\": \\\"o\\\", \\\"9\\\": \\\"t\\\", \\\"10\\\": \\\"s\\\", \\\"11\\\": \\\"c\\\", \\\"12\\\": \\\"u\\\", \\\"13\\\": \\\"d\\\", \\\"14\\\": \\\"g\\\", \\\"15\\\": \\\"p\\\", \\\"16\\\": \\\"b\\\", \\\"17\\\": \\\"m\\\", \\\"18\\\": \\\"h\\\", \\\"19\\\": \\\"y\\\", \\\"20\\\": \\\"w\\\", \\\"21\\\": \\\"k\\\", \\\"22\\\": \\\"f\\\", \\\"23\\\": \\\"v\\\", \\\"24\\\": \\\"z\\\", \\\"25\\\": \\\"q\\\", \\\"26\\\": \\\"j\\\", \\\"27\\\": \\\"x\\\", \\\"28\\\": \\\"(\\\", \\\"29\\\": \\\")\\\", \\\"30\\\": \\\"-\\\", \\\"31\\\": \\\"\\\\u00e3\\\", \\\"32\\\": \\\"\\\\u00e2\\\", \\\"33\\\": \\\"'\\\", \\\"34\\\": \\\"\\\\u0192\\\", \\\"35\\\": \\\"1\\\", \\\"36\\\": \\\"\\\\u00ad\\\", \\\"37\\\": \\\"\\\\u201a\\\", \\\"38\\\": \\\"\\\\u00a9\\\", \\\"39\\\": \\\"/\\\", \\\"40\\\": \\\"\\\\u00e9\\\", \\\"41\\\": \\\"9\\\", \\\"42\\\": \\\"\\\\u20ac\\\", \\\"43\\\": \\\"\\\\u0161\\\", \\\"44\\\": \\\"\\\\u2019\\\", \\\"45\\\": \\\"&\\\", \\\"46\\\": \\\"[\\\", \\\"47\\\": \\\"]\\\", \\\"48\\\": \\\"\\\\u00e0\\\", \\\"49\\\": \\\"\\\\u00fa\\\", \\\"50\\\": \\\"2\\\", \\\"51\\\": \\\"#\\\", \\\"52\\\": \\\"3\\\", \\\"53\\\": \\\".\\\", \\\"54\\\": \\\"\\\\u00b1\\\", \\\"55\\\": \\\"\\\\u00a2\\\", \\\"56\\\": \\\"\\\\u00e5\\\", \\\"57\\\": \\\"7\\\", \\\"58\\\": \\\"\\\\u00eb\\\", \\\"59\\\": \\\"\\\\u2020\\\", \\\"60\\\": \\\"_\\\", \\\"61\\\": \\\"\\\\u00a4\\\", \\\"62\\\": \\\"\\\\u00ac\\\", \\\"63\\\": \\\"\\\\u00b9\\\", \\\"64\\\": \\\"\\\\u00bc\\\"}\", \"word_index\": \"{\\\"e\\\": 1, \\\"a\\\": 2, \\\"r\\\": 3, \\\" \\\": 4, \\\"l\\\": 5, \\\"n\\\": 6, \\\"i\\\": 7, \\\"o\\\": 8, \\\"t\\\": 9, \\\"s\\\": 10, \\\"c\\\": 11, \\\"u\\\": 12, \\\"d\\\": 13, \\\"g\\\": 14, \\\"p\\\": 15, \\\"b\\\": 16, \\\"m\\\": 17, \\\"h\\\": 18, \\\"y\\\": 19, \\\"w\\\": 20, \\\"k\\\": 21, \\\"f\\\": 22, \\\"v\\\": 23, \\\"z\\\": 24, \\\"q\\\": 25, \\\"j\\\": 26, \\\"x\\\": 27, \\\"(\\\": 28, \\\")\\\": 29, \\\"-\\\": 30, \\\"\\\\u00e3\\\": 31, \\\"\\\\u00e2\\\": 32, \\\"'\\\": 33, \\\"\\\\u0192\\\": 34, \\\"1\\\": 35, \\\"\\\\u00ad\\\": 36, \\\"\\\\u201a\\\": 37, \\\"\\\\u00a9\\\": 38, \\\"/\\\": 39, \\\"\\\\u00e9\\\": 40, \\\"9\\\": 41, \\\"\\\\u20ac\\\": 42, \\\"\\\\u0161\\\": 43, \\\"\\\\u2019\\\": 44, \\\"&\\\": 45, \\\"[\\\": 46, \\\"]\\\": 47, \\\"\\\\u00e0\\\": 48, \\\"\\\\u00fa\\\": 49, \\\"2\\\": 50, \\\"#\\\": 51, \\\"3\\\": 52, \\\".\\\": 53, \\\"\\\\u00b1\\\": 54, \\\"\\\\u00a2\\\": 55, \\\"\\\\u00e5\\\": 56, \\\"7\\\": 57, \\\"\\\\u00eb\\\": 58, \\\"\\\\u2020\\\": 59, \\\"_\\\": 60, \\\"\\\\u00a4\\\": 61, \\\"\\\\u00ac\\\": 62, \\\"\\\\u00b9\\\": 63, \\\"\\\\u00bc\\\": 64}\"}}"