Repository: pypi-data/pypi-mirror-57
Catalog: packages/Products.EasyNewsletter/Products.EasyNewsletter-5.0.0a8.tar.gz/Products.EasyNewsletter-5.0.0a8/src/Products/EasyNewsletter/locales/*/LC_MESSAGES/plone.po
Languages: es, nl

source: - Essentially a workflow with no transitions, but has a Published state, so portlets and applications that expect that state will continue to work.
es: - Esencialmente se trata de un flujo de trabajo sin transiciones, aunque tiene un estado Publicado, de forma que los portlets y aplicaciones que esperan dicho estado puedan seguir funcionando.
nl: - Een workflow zonder overgangen, maar met een gepubliceerd status, zodat portlet en add'ons die deze status verwachten goed blijven werken.

source: Aggregate content
es: Contenido agregado
nl: Inhoud samenvoegen

source: Copy as draft
es: Copiar como borrador
nl: Kopieer als concept

source: Copy as master
es: Copiar como maestra
nl: Kopieer als master

source: Draft
es: Borrador
nl: Concept

source: Drafts
nl: Concepten

source: Edit criteria
es: Editar criterio
nl: Bewerk criteria

source: Make draft
es: Hacer borrador
nl: Maak concept

source: Make master
es: Hacer maestra
nl: Maak master

source: Manage subcollections
es: Administrar subcolecciones
nl: Beheer subverzamelingen

source: Revert sending
es: Revertir envio
nl: Herstel versturen

source: Send
es: Enviar
nl: Verstuur

source: Sending
es: Enviando
nl: Aan het versturen

source: Sending Completed
es: Envió completado
nl: Versturen afgerond

source: Sent
es: Enviado
nl: Verstuurd

source: Single State Workflow for a EasyNewsletter Issue
es: Flujo de trabajo simple estado para una emisión de EasyNewsletter
nl: Single State workflow voor een EasyNewsletter editie

source: Templates
nl: Sjablonen

source: description_newsletter_subscriber_portlet
es: Portlets para agregar suscriptores.
nl: Portlet voor het aanmelden van abonnees

source: title_newsletter_subscriber_portlet
es: Portlet de suscripción al boletín de noticias
nl: Nieuwsbrief aanmeldportlet

source: Subscribers
nl: Abonnees

source: Master
es: Maestra
