Repository: pypi-data/pypi-mirror-57
Catalog: packages/collective.pwexpiry/collective.pwexpiry-0.15.1.zip/collective.pwexpiry-0.15.1/collective/pwexpiry/locales/*/LC_MESSAGES/collective.pwexpiry.po
Languages: de

source: Adds the feature of password expiration control.
de: Ermöglicht es Passworte ablaufen zu lassen und Qualitätskriterien von Passworten zu prüfen.

source: Login failed. Both email address and password are case sensitive, check that caps lock is not enabled. If you have entered your password correctly, your account might be locked. You can reset your password, or contact an administrator to unlock it, using the Contact form.
de: Anmeldung fehlgeschlagen. Sowohl bei der E-Mail-Adresse als auch beim Passwort wird Groß- und Kleinschreibung berücksichtigt. Stellen Sie sicher, dass die Feststelltaste nicht eingerastet ist.Wenn Sie ihr Passwort korrekt eingegeben haben könnte ihr Konto gesperrt sein. Sie können Ihr Passwort zurücksetzen oder einen Administrator über das Kontakt Formular bitten es zu entsperren.

source: Login failed. Both login name and password are case sensitive, check that caps lock is not enabled. If you have entered your password correctly, your account might be locked. You can reset your password, or contact an administrator to unlock it, using the Contact form.
de: Anmeldung fehlgeschlagen. Sowohl bei Benutzername als auch beim Passwort wird Groß- und Kleinschreibung berücksichtigt. Stellen Sie sicher, dass die Feststelltaste nicht eingerastet ist.Wenn Sie ihr Passwort korrekt eingegeben haben könnte ihr Konto gesperrt sein. Sie können Ihr Passwort zurücksetzen oder einen Administrator über das Kontakt Formular bitten es zu entsperren.

source: Never
de: Nie

source: No users were unlocked
de: Keine Benutzer wurden entsperrt

source: Password expiration
de: Passwortablauf

source: Passwords must be at least 8 characters in length.
de: Passwörter müssen aus mindestens 8 Zeichen bestehen.

source: Passwords must contain at least three of the following four character groups: Uppercase characters (A through Z), Lowercase characters (a through z), Numerals (0 through 9), Special characters such as !, $, #, %
de: Passwörter müssen mindestens 3 der folgenden Zeichengruppen enthalten: Großbuchstaben (A - Z), Kleinbuchstaben (a - z), Nummern (0 - 9), Spezial Schriftzeichen wie !, $, #, %

source: The following users were unlocked: %s,
de: Die folgenden Benutzer wurden entsperrt: %s,

source: User's password expiration panel
de: Passwortablauf Einstellungen des Benutzers

source: You have to change your password.
de: Sie müssen Ihr Passwort ändern.

source: Your password cannot contain your account name(Username), first name or last name.
de: Ihr Passwort darf weder ihren Benutzer- noch ihren Nach- oder Vornamen enthalten.

source: Your password has expired.
de: Ihr Passwort ist abgelaufen.

source: change_password_email_text
de: Um Ihr Passwort zu ändern rufen Sie bitte ${server_url}/@@change-password auf.

source: collective.pwexpiry
de: Passwortablauf (collective.pwexpiry)

source: collective.pwexpiry: Plone 4 only profile
de: Passwortablauf (collective.pwexpiry) Plone 4

source: description_pas_show_all_search_results
de: Zeige alle Suchresultate

source: description_password_expiration
de: Zeige und administriere die Passwortablauf Einstellungen der Benutzer.

source: email_subject
de: Ihr Passwort läuft in ${days} Tagen ab

source: email_text
de: Hallo ${username}, Ihr Passwort läuft in ${days} Tagen ab. Bitte ändern Sie Ihr Passwort bevor es abläuft!

source: info_reused_pw
de: Dieses Passwort wurde schon einmal verwendet.

source: label_apply_changes
de: Änderungen übernehmen

source: label_save_whitelist
de: Speichern

source: label_whitelist_users
de: Benutzer ohne Passwortablauf

source: reset_password_email_text
de: Um Ihr Passwort zurückzusetzen, rufen Sie bitte ${server_url}/mail_password_form?userid=${username} auf

source: server_name_email_text
de: Diese Email wurde von ${server_name} versendet.
